Autodesk.Revit.DB.Analysis.MEPNetworkSegmentData.GetDownstreamSegments
Gets all downstream network segments.
Returns:
The list of segments that flow out of this segment.
Since:
2024

Autodesk.Revit.DB.Analysis.MEPNetworkSegmentData.GetUpstreamSegments
Gets all upstream network segments.
Returns:
The list of segments that flow into this segment.
Since:
2024

Autodesk.Revit.DB.Analysis.MEPNetworkSegmentData.IsValid
Verified if this segment data has been assigned some valid values afer calculation.
Returns:
True if the segment was assigned valid values, otherwise false.
Since:
2024

Autodesk.Revit.DB.Analysis.MEPNetworkSegmentData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Analysis.MEPNetworkSegmentData.Coefficient
The calculated coefficient of this segment, dimensionless.
Since:
2024

Autodesk.Revit.DB.Analysis.MEPNetworkSegmentData.PressureDrop
The calculated pressure drop of this segment, in kg/(ft*s^2).
Since:
2024

Autodesk.Revit.DB.Analysis.MEPNetworkSegmentData.VelocityPressure
The calculated velocity pressure of this segment, in kg/(ft*s^2).
Since:
2024

Autodesk.Revit.DB.Analysis.MEPNetworkSegmentData.Velocity
The calculated velocity of this segment, in ft/s.
Since:
2024

Autodesk.Revit.DB.Analysis.MEPNetworkSegmentData.FrictionFactor
The calculated friction factor of this segment, dimensionless.
Since:
2024

Autodesk.Revit.DB.Analysis.MEPNetworkSegmentData.RelativeRoughness
The relative roughness of this segment, dimensionless.
Since:
2024

Autodesk.Revit.DB.Analysis.MEPNetworkSegmentData.ReynoldsNumber
The Reynolds number of this segment, dimensionless.
Since:
2024

Autodesk.Revit.DB.Analysis.MEPNetworkSegmentData.FlowState
The calculated flow state of this segment.
Since:
2024

Autodesk.Revit.DB.Analysis.MEPNetworkSegmentData.Flow
The calculated flow of this segment, in ft^3/s. The positive value means the flow is from the start to the end node, the negative value means opposite direction.
Since:
2024

Autodesk.Revit.DB.Analysis.MEPNetworkSegmentData.SectionNumber
The section this segment belongs to.
Since:
2024

Autodesk.Revit.DB.Analysis.MEPNetworkSegmentData.IsCriticalPath
Verifies if the segment is on the critical path.
Since:
2024

Autodesk.Revit.DB.Analysis.MEPNetworkSegmentData.#ctor(Autodesk.Revit.DB.Analysis.MEPNetworkSegmentData)
Creates a new segment data object based on another object.
other:
The other segment data that the new object is based on.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.Analysis.MEPNetworkSegmentData.#ctor
Creates a default segment data object.
Since:
2024

Autodesk.Revit.DB.Analysis.MEPNetworkSegmentData
Represents the analysis data for one network segment.
Since:
2024